[
          {
                    "numero": 1,
                    "titulo": "DESENVOLVIMENTO DE APLICATIVO EM ANDROID PARA SNIFFER DE REDE ",
                    "autor": [
                              "1° Ten TIAGO OLIVEIRA SALDANHA",
                              "ANTONIO LUIS SOMBRA DE MEDEIROS"
                    ],
                    "orientador": "Orientador: Maj Anderson Fernandes Pereira dos Santos - D.Sc., ",
                    "ano": 2016,
                    "resumo_pt": "\n\nEste projeto tem por finalidade propor, desenvolver e analisar um aplicativo de sniffer\nde rede, fazendo uma andalise da sua utilizagaéo bem como da extensao das informacgoes\npossiveis de serem obtidas através de um aplicativo basico desse tipo.\n\nO aplicativo permite a coleta de pacotes de rede a partir do momento em que algum\nindividuo se conecte ao hotspot criado por ele, o qual é configurado de modo a se asseme-\nlhar a alguma rede wireless existente no ambiente.\n\nOptou-se pela implementacaéo para Android por ser a plataforma moével de maior\nabertura atualmente. Ja existem bibliotecas e projetos em linguagem JAVA que podem\nser utilizadas para facilitar a captura de pacotes de rede e algumas APIs do proprio An-\ndroid ja facilitam 0 processo. O aplicativo construido foi sujeito a um experimento pratico\nrealizado dentro do Instituto Militar de Engenharia e foi verificado a captura de pacotes\n\nde usuarios conectados ao hotspot criado.\n\n11\n\f",
                    "resumo_en": "\n\nThe purpose of this project is the suggestion, development and analysis of a packet-\nsniffing app, also doing an analysis of the app usage, as well as of the extension of the\ninformation able to be captured by a basic app of this type.\n\nThe app allows the packet sniff as soon as the subject connects his device to the\nhotspot, created and set up by the app to mimic an already existing local wireless network.\n\nIt was chosen to implement the app for Android because it is the most open mobile\nplatform nowadays. There are JAVA libraries and projects that can be used to help the\nimplementation of a packet sniffer and some Android APIs really help the process. The\napplication was built and submited to an experiment held within the Instituto Militar\nde Engenharia, where was verified that the application successfully capture packets from\n\nusers connected to the created hotspot.\n\n12\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2016/2016-Saldanha.pdf"
          },
          {
                    "numero": 2,
                    "titulo": "DESENVOLVIMENTO DE ALGORITMOS DE SEGMENTAGAO DE IMAGENS EM AMBIENTE ANDROID ",
                    "autor": [
                              "Cap BRUNO AVELINO DE ARAUJO OLIVEIRA",
                              "JAYME BOARIN DE MAGALHAES ALVIM"
                    ],
                    "orientador": "Orientadora: Prof*. Carla Liberal Pagliari - Ph.D., Co-Orientador: Prof. Marcelo de Mello Perez - Ph.D., ",
                    "ano": 2017,
                    "resumo_pt": "\n\nSegmentagéo € uma importante etapa do processamento digital de imagens. Com\num ntimero cada vez maior de aplicacoes relacionadas ao domino de viséo computacional,\nmais presente se faz a necessidade de se aprofundar na identificagao e andlise de regides\nrelevantes de uma imagem a fim de obter melhores resultados e conclusdes por meio da\nsegmentacao.\n\nEmbora a identificagao de imagens seja algo natural e uma atividade consideravel-\nmente facil para os seres humanos, a mesma tarefa em sistemas computacionais automa-\ntizados torna-se significativamente mais complexa. Com a crescente tendéncia de utili-\nzagao de maquinas e sistemas para a realizacao das atividades na sociedade, nota-se a\nimportancia de desenvolver e implementar novas ferramentas capazes de trazer uma nova\nabordagem ao problema. Considerado como um problema mal colocado, isto é, para o\nqual nao ha uma solucao universal, o estudo das principais técnicas consolidadas e o de-\nsenvolvimento de novas é a estratégia que se procura utilizar em projetos de pesquisa\nnesse dominio.\n\nEsse projeto introduz o problema da segmentacao, abordando sua motivagao, suas\ndificuldades e sua aplicacao, apresenta o estudo das técnicas mais relevantes e, como ob-\njetivo principal, desenvolve um aplicativo mével em ambiente Android para a segmentacao\n\nde imagens.\n\n13\n\f",
                    "resumo_en": "\n\nImage segmentation is an important stage of the digital processing of images. With\nan increasing number of applications related to the field of computer vision, the more\npresent the need to deepen the identification and analysis of relevant regions of an image\nin order to obtain better results and conclusions through segmentation.\n\nAlthough the identification of images is something natural and a considerably easy\nactivity for humans, the same task in automated computer systems becomes significantly\nmore complex. With the growing tendency to use machines and systems to carry out\nactivities in society, it is important to develop and implement new tools capable of bringing\na new approach to the problem. Considered as an \"ill-posed\"problem, that is, for which\nthere is no universal solution, the study of the main consolidated techniques and the\ndevelopment of new ones is the strategy that is sought to be used in research projects in\nthis field.\n\nThis project introduces the problem of segmentation, approaching its motivation,\ndifficulties and its application, presents the study of the most relevant techniques and, as\n\nmain objective, develops an Android mobile application for the segmentation of images.\n\n14\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2017/PFC - Avelino.pdf"
          },
          {
                    "numero": 3,
                    "titulo": "INSTALACAO E CONFIGURACAO DE SERVICOS WEB PARA DISPONIBILIZACAO DE DADOS ESPACIAIS EM OPERACOES MILITARES ",
                    "autor": [
                              "Ten ARTHUR FERNANDES ARAUJO",
                              "Ten MAIARA BARROSO CARDOSO REINALDO"
                    ],
                    "orientador": "Orientador: Ivanildo Barbosa, ",
                    "ano": 2015,
                    "resumo_pt": "\n\nO avango da tecnologia permitiu a utilizagéo de ferramentas computacionais para\narmazenar e disponibilizar informacées geograficas. Com isso, permitiu-se 0 desenvolvimento\nde aplicacgdes para visualizagao de dados geograficos, onde dados geoespaciais adicionais\nestéo associados a uma localizagéo. Essas aplicagdes podem ser utilizadas para as mais\nvariadas finalidades, como no auxilio ao planejamento e condugao de operacdes militares.\nTendo em vista a importancia do uso de informag6es geograficas e as vantagens obtidas ao se\nutilizar as tecnologias apropriadas para a manipulagao e visualizacao de dados geoespaciais,\nesse projeto visa a instalacéo e configurac¢ao de um servi¢o web para disponibilizagao de\ndados espaciais em operagdes militares. Os requisitos para o servidor de mapas a ser\ncustomizado incluem: dividir os usuarios em categorias de acordo com as permissGes de\nacesso que estes possuam, permitir ao usuario visualizar e interagir com mapas, oferecer ao\nusuario opgoes de visualizagao de outras camadas no mapa, permitir 0 acesso a aplicacaéo em\nqualquer navegador e possuir interface que seja compativel com plataformas desktop e\nplataformas moveis, entre outras funcionalidades. O servidor de mapas pode ser aplicado\ncomo forma de apoio a deciséo em operagées militares, permitindo controle de acesso de\nacordo com 0 cargo ocupado ou alguma outra caracteristica especifica do usuario. Por ser uma\naplicagéo web, pode ser utilizada por meio de plataformas méveis em campos de batalha.\nAlém disso, existe a possibilidade de criagéo de superposicées taticas ou camadas digitais\n\ngeorreferenciadas que podem ser adicionadas aos dados geoespaciais da aplicagao.\n\n11\n\f",
                    "resumo_en": "\n\nAdvances in technology allowed the use of computational tools to store and provide\ngeographic information. Having that, it was then possible to develop applications to visualize\ngeographic data, where additional geospatial data can be associated to one location. These\napplications can be utilized for the most variable purposes, as a support for planning and\nconducting military operations, for example. In view of the importance of the use of\ngeographic information and the advantages obtained when the appropriate technologies are\nutilized to manipulate and visualize geospatial data, this project aims to install and to set up a\nweb service to provide spatial data in military operations. The requirements to the maps server\nto be customized include: split the users into categories according to the access permissions\nthat they have, allow the users to visualize and interact with maps, offer the user options to\nvisualize other layers in the map, allow the access to the application in any browser and have\nan interface that is compatible with desktop platforms and mobile platforms, among other\nfeatures. The maps server can be applied as a way of decision support in military operations,\nallowing the access control according to the occupied position or any other characteristic of\nthe user. Once it is a web application, it can be used through mobile platforms in battlefields.\nBesides that, there is the possibility of creating tactic superpositions or georeferenced digital\n\nlayers that can be added to the geospatial data of the application.\n\n12\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2015/2015-Araujo.pdf"
          },
          {
                    "numero": 4,
                    "titulo": "IMPLEMENTAGAO DE ESTRUTURAS DE DADOS AVANGADAS PARA PROBLEMAS EM GRAFOS DINAMICOS ",
                    "autor": [
                              "BRUNA ALVES RAMALHO",
                              "FABIO VIANA LOPES ANDRADE DA SILVA"
                    ],
                    "orientador": "Orientadora: Prof*. Claudia Marcela Justel - D.Sc., Co-Orientadora: Prof*. Lilian Markenzon - Ph.D., ",
                    "ano": 2019,
                    "resumo_pt": "\n\nAlgoritmos dinamicos para resolugao de problemas em grafos representam um ramo\nda Computacgao que vem recebendo cada vez mais atengao nos tltimos anos. O intuito\ndeste trabalho é disponibilizar uma interface de facil utilizagao para usuarios de diferentes\ndominios, que nao necessite de conhecimento de programagao, abordando alguns proble-\nmas em grafos, como reconhecimento de classes e geracaéo estatica e dinamica de grafos\naleatorios pertencentes a determinadas classes. Para o desenvolvimento destes algoritmos,\nsao apresentadas as caracterizagdes dessas classes de grafos, em especial para os grafos\ncordais e suas subclasses. Finalmente, foram implementadas estruturas de dados avanga-\n\ndas, que tornam estes algoritmos eficientes.\n\f",
                    "resumo_en": "\n\nAlgorithms for problem solving in dynamic graphs represent a branch of computing\nthat has received increasing attention in recent years. The purpose of this work is to pro-\nvide an easy-to-use tool for users from different domains, who do not need programming\nknowledge, addressing some problems in graphs, such as graph class recognition and both\nstatic and dynamic generation of random graphs for certain classes. For the development\nof these algorithms, we will discuss the characterizations of some classes of graphs, espe-\ncially for the chordal graphs and their subclasses, besides certain problems for this family,\n\nand finally implement advanced data structures, that make these algorithms efficient.\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2019/PFC - Bruna.pdf"
          },
          {
                    "numero": 5,
                    "titulo": "LEONARDO LINHARES MUNIZ RIBEIRO DESENVOLVIMENTO DE UMA BIBLIOTECA DE PROVENIENCIA DE DADOS PARA EXPERIMENTOS DE APRENDIZADO DE MAQUINA EM C++ ",
                    "autor": [
                              "1 Ten LUCAS BRAIDA NAZARETH",
                              "1 Ten RODRIGO GOMES LEMOS"
                    ],
                    "orientador": "Orientador: TC Julio Cesar Duarte - D.Sc., ",
                    "ano": 2018,
                    "resumo_pt": "\n\nExperimentos de aprendizado de maquina estao cada vez mais em alta no mundo\nda computagao. O grande ntimero de ferramentas e utilizagoes fez com que esse campo\nexpandisse e o ntmero de pesquisadores usando tais métodos aumentasse consideravel-\nmente. O elevado nimero de ferramentas nas mais diversas linguagens de programagao\nlevou a geragao de dados nao padronizados que, por sua vez, aumentaram a dificuldade\nna troca de informagoées e na reprodugéo de experimentos. Além disso, a falta de notagao\nda proveniéncia dos dados surge como mais um empecilho pra a difuséo do conhecimento.\n\nCom fim de solucionar os problemas de proveniéncia dos dados foi criado 0 Projeto\nMEX. O projeto é composto por uma série de ferramentas que visa, de forma facil, per-\nmitir ao usuario registrar seus dados e metadados. Além disso, 0 projeto propde um\nvocabulario para os experimentos de aprendizado de maquina e uma forma automatizada\nde transcrever as informagdes para um padrao em RDF. O projeto possuia a limitagao de\nso poder ser utilizado em experimento em Java, fato que foi resolvido pela criagao do ser-\nvicgo web Web4MEX. O Web4MEX é um servigo web que visa possibilitar a utilizagao das\nferramentas do projeto MEX por experimentos em linguagem de programagao diferente\nde Java. Através da troca de pacotes JSON, o usuario pode enviar seus dados e receber\num RDF formatado. Para fim de facilitar a utilizagao desse servico foi desenvolvido um\nframework em Python que realizasse a comunicacao para o usuario.\n\nO objetivo desse projeto é desenvolver uma biblioteca em C++ que permita a co-\nmunicagao com o servigo Web4MEX de forma que possa ser utilizado pelo FAMa. Dessa\nmaneira, uma nova gama de dados de experimentos poderao ser utilizados, de forma facil\n\ne pratica, formatados e padronizados.\n\f",
                    "resumo_en": "\n\nMachine Learning experiments are being more and more discussed by the day in\nthe computer science world. The high variety of tools and utilizations made possible\nthe growth of this field and the number of researchers utilizing its methods. The ele-\nvated number of tools on a high variety of programming languages led to the creation\nof non-stardard data which increased the difficulties on the exchange of information and\nreproductions of experiments. The lack of notation on the data input came as another\nbarrier for the knowledge spread.\n\nWith the intent to solve the data input problem the MEX project was createad. This\nproject is composed by a series of tools that tries to allow the user to register its data and\nmetadata in an easy way. It also propose a new vocabulary to machine learning experi-\nments and a automated way to transcript the information in the RDF pattern. The MEX\nproject had a restriction that it could only be used within Java experiments, and for that,\nthe Web4MEX was created. The Web4MEX is a web service that makes enables the use\nof the MEX project by experiments made with programming languages other than Java.\nBy using exchange of JSON packages, the user can send his data and receive a formatted\nRDF. In order to help the use of this service, a Python framework was developed to do\nthe communication with the user.\n\nThe objective of this project is to develop a framework in C++ to make the commu-\nnication with the Web4MEX service in order to make possible its utilization by FAMa,\nthus enabling this for whole new level of experiment data that may be formatted in an\n\neasy and praticle way.\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2018/PFC - Braida.pdf"
          },
          {
                    "numero": 6,
                    "titulo": "LUDOCUS - FERRAMENTA DE GAMIFICACAO PARA QUALQUER EXPERIENCIA ",
                    "autor": [
                              "BRUNELLI GABRIEL CUPELLO",
                              "FABIO HENRIQUE DATOLLA"
                    ],
                    "orientador": "Orientador(es): Ricardo Choren Noya, D.Sc., Leandro de Mattos Ferreira, M.Sc., ",
                    "ano": 2020,
                    "resumo_pt": "\n\nNa geracao atual, ninguém fica mais parado. Todos sao sobrecarregados com infor-\nmagoes novas 24 horas por dia. Ninguém mais precisa ler revistas na sala de espera do\nconsultério médico, nem olhar para a paisagem no trajeto do 6énibus para passar o tempo.\nAssim, nao é uma surpresa o fato de muitos alunos apresentarem dificuldades em se\nconcentrar nas aulas, onde, em alguns casos, nao ha um estimulo suficiente. As\npessoas sempre tém algo a fazer mais interessante do que suas atividades atuais. Com isso,\nelas perdem o foco nas atividades do dia a dia e esquecem o que é importante.\nA gamificagao, através do estudo da forma como as pessoas engajam em suas experiénci-\nais, apresenta-se como uma solugdéo para motivar e facilitar a execucao de tarefas de\nestudo, trabalho e até mesmo o uso de sistemas de informagao.\n\nDessa forma, este trabalho desenvolveu uma solugaéo para, integrada a uma ferra-\nmenta de visualizagéo de dados, gamificar experiéncias no processo de ensino-\naprendizagem em instituigdes de ensino, tornando as mesmas divertidas, favorecendo\n\no aumento do engajamento de alunos e professores.\n\nPalavras-chave: Gamificagéo. Ensino. Aprendizagem. Jogos.\n\f",
                    "resumo_en": "\n\nIn the current generation, nobody stands still. Everyone is overwhelmed with new\ninformation 24 hours a day. No one else has to read magazines in the waiting room of\nthe doctor’s office or look at the landscape on the bus route to pass the time. Thus, it is\nnot surprising that many students have difficulties in concentrating on classes, where,\nin some cases, there is not enough stimulus. People always have something to do\nthat is more interesting than their current activities. As a result, they lose focus on\nday-to-day activities and textbf forget what is important. gamification, through the\nstudy of how people engage in their experiences, presents itself as a solution to motivate\nand facilitate the execution of study tasks, work and even the use information\nsystems.\n\nThus, this work developed a solution for, integrated with a data visualization tool,\ngamify experiences in the teaching-learning process in educational institutions,\n\nmaking them fun, favoring increased student and teacher engagement.\n\nKeywords: Gamification. Teaching. Learning. Games.\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2020/PFC_Brunelli_Datolla.pdf"
          },
          {
                    "numero": 7,
                    "titulo": "CONTROLE DE DRONES ATRAVES DO RECONHECIMENTO DE IMAGENS DO TERRENO ",
                    "autor": [
                              "CARLA SZE COSENZA",
                              "LUCAS BASTOS GERMANO"
                    ],
                    "orientador": "Orientador(es): Paulo Fernando Ferreira Rosa, Ph.D., Erick Menezes Moreira, D.Sc., Marlos de Mendonga Corréa, M.Sc., ",
                    "ano": 2020,
                    "resumo_pt": "\n\nA industria de drones jé possuf um valor biliondrio, e mesmo assim prevé um grande\ncrescimento nos proximos anos. Isto é devido ao fato que essas aeronaves estéo cada vez\nmais sendo utilizadas para realizacaéo de tarefas comerciais, como entregar compras e\nmonitorar plantacdes. Conseguir navegar é uma tarefa essencial para estes robés e suas\nnovas funcionalidades esto exigindo cada vez mais dessa tecnologia. Atualmente, vem-se\nconfiando demasiadamente na utilizagao dos sistemas de geolocalizacao por satélite; todavia,\nseu erro de aproximacao impossibilita tarefas de localizagéo com requisitos de acuracia\nadequados e sua falta de estabilidade, em certos ambientes, demanda outras tecnologias\npara garantir a movimentagao precisa de aeronaves remotamente pilotadas. Este trabalho\nprop6e uma solucao para a navegacao através do reconhecimento de imagens do terreno.\nNele, um veiculo em movimento é equipado com uma cémera para capturar imagens e\num algoritmo de scene matching identifica pontos chaves dessas imagens, relacionando-as\ncom um conjunto de imagens previamente adquirido, localizando o drone no terreno. Os\nresultados foram avaliados em uma simulagéo de pequena escala de uma base petrolifera\nreal, proveniente do desafio Petrobras, que é motivado por tarefas de interesse da industria\nde dleo e gds. Obteve-se um software, que gera a navegacao correta em ambientes fechados\ncom controle de luz e um mapa pequeno.\n\n \n\nPalavras-chave: navegacao aut6noma. visio computacional. scene matching.\n\f",
                    "resumo_en": "\n\nThe drone industry is already worth billions and studies still predict a considerate growth\nin the upcoming years. This is due to the fact that these aircrafts are increasingly being\nused to perform jobs such as delivering good and monitoring plantations. Being able to\nnavigate is an essential task for these robots, and their new functionalities are demanding\nmore from this technology. Geolocation systems have been deeply replied on, though their\nestimation error makes it impossible to perform tasks that require precision and their\nlack of stability in certain environments shows the necessity of needing other technologies\nto guarantee the precise movement of remotely piloted aircrafts. This project presents\na solution for navigation through the recognition of images of the terrain. The robot in\nmovement is equipped with a camera to capture images and a scene matching algorithm\nidentifies key points of that image, matching them with a set o previously acquired images,\nlocating the drone the in terrain. The obtained results were evaluated in a small scale\nsimulation of a real oil base, based on the Petrobras challenge, which is inspired by real\ntasks of interest of the oil and gas industry. A robust software was obtained, that generates\nthe correct navigation for close environments with light control and a small map.\n\nKeywords: autonomous navigation. computer vision. scene matching.\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2020/PFC-CarlaGermano.pdf"
          },
          {
                    "numero": 8,
                    "titulo": "INTERACAO POR HAND-TRACKING EM AMBIENTE DE REALIDADE VIRTUAL ",
                    "autor": [
                              "MATEUS CANDIDO LIMA DE CASTRO",
                              "JOAO PEDRO DE ARAUJO XAVIER"
                    ],
                    "orientador": "Orientador(es): Paulo Fernando Ferreira Rosa, Ph.D., Jauvane Cavalcante de Oliveira, Ph.D., ",
                    "ano": 2020,
                    "resumo_pt": "\n\nImerséo em ambientes virtuais esta se tornando mais popular. Diversas empresas, como\nSamsung, Google e Facebook, investem nestas tecnologias. Apesar disto, os produtos mais\nconhecidos, como 0 Samgung Gear VR e 0 Google Card Board, nao oferecem nenhum\ntipo de suporte a interagao natural, implementando interagéo por meio de botdes. Ja o\nOculus Rift, do Facebook, oferece um meio de interagdo mais natural, usando as maos, mas\nutiliza mUltiplos sensores. Este trabalho descreve a criagdéo de um sistema de baixo custo\nque permite a interagao de um usuario com ambientes virtuais modelados em Unity e\nvisualizados através de um celular em um Google Cardboard - um éculos de realidade virtual.\nO modelo proposto para interacaéo se baseia na aplicagao de algoritmos de hand-tracking\nem quandros capturados por uma tinica camera RGB do celular. O objetivo é utilizar\neste sistema para realizar uma tarefa de pick-and-place. A contribuicgéo deste trabalho\nconsiste na criagao e disponibilizagao do cédigo, em um repositdério open-source, do sistema\n\nproposto para integracgao em aplicacoes.\n\nPalavras-chave: Redes Neurais. Aprendizado Profundo. Realidade Virtual. Sistema de\n\nTempo Real. Andlise de Imagens. Detecgao de Pose.\n\f",
                    "resumo_en": "\n\nImmersion in virtual environments is becoming more popular. Several companies, like\nSamsung, Google and Facebook have invested in these technologies. However, the well-known\nproducts, like the Samgung Gear VR and the Google Card Board offer no support for\nnatural interaction with the virtual environment, but rather interaction through buttons.\nFacebook’s Rift Glasses does offer a more natural interaction media, using hands, though it\nuses multiple sensors. The work describes the elaboration of a low-cost system that allows\nuser interaction with VR environments modeled in Unity and viewed through a cellphone\ninside a Google Cardboard - virtual reality glasses. The model proposed for interaction is\nbased on applying Hand-Tracking algorithms in frames captured by a single RGB camera\nof the cellphone. The main objective is to use this system to perform a pick-and-place task.\nThe main contribution consists of creating and providing the proposed system’s code in\nan open-source repository to integrate it into other applications easily.\n\nKeywords: Neural Networks. Deep Learning. Virtual Reality. Real-time Systems. Image\n\nAnalysis. Pose Tracking.\n\f",
                    "file": "/home/julio_rosa/portal/graduacao_new/portal_comp/grad/modules/files/pfc/2020/PFC_DeCastroXavier.pdf"
          }
]